#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.repository["dao-aip"].github_branch_default.default will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_branch_default" "default" {
      - branch     = "main" -> null
      - id         = "dao-aip" -> null
      - rename     = false -> null
      - repository = "dao-aip" -> null
    }

  # module.repository["dao-aip"].github_branch_protection.all["*"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_branch_protection" "all" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = true -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOMnbeDM4DMqlc" -> null
      - lock_branch                     = false -> null
      - pattern                         = "*" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "dao-aip" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = true -> null
      - required_linear_history         = false -> null
    }

  # module.repository["dao-aip"].github_branch_protection.all["**/**"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_branch_protection" "all" {
      - allows_deletions                = true -> null
      - allows_force_pushes             = true -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOMnbeDM4DMqlR" -> null
      - lock_branch                     = false -> null
      - pattern                         = "**/**" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "dao-aip" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = true -> null
      - required_linear_history         = false -> null
    }

  # module.repository["dao-aip"].github_branch_protection.protection["main"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_branch_protection" "protection" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = false -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOMnbeDM4DMqlf" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "dao-aip" -> null
      - require_conversation_resolution = true -> null
      - require_signed_commits          = true -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [
              - "A_kwHOBayTi84AAq0w",
            ] -> null
          - require_code_owner_reviews      = true -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 1 -> null
          - restrict_dismissals             = true -> null
        }

      - required_status_checks {
          - contexts = [] -> null
          - strict   = true -> null
        }
    }

  # module.repository["dao-aip"].github_repository.repository will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository" "repository" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archive_on_destroy          = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Arrowair DAO Arrow Improvement Proposals" -> null
      - etag                        = "W/\"65791b0913667170bf8721e2782a64c5810eb84612e273387305b9b9f3b58eec\"" -> null
      - full_name                   = "Arrow-air/dao-aip" -> null
      - git_clone_url               = "git://github.com/Arrow-air/dao-aip.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
      - html_url                    = "https://github.com/Arrow-air/dao-aip" -> null
      - http_clone_url              = "https://github.com/Arrow-air/dao-aip.git" -> null
      - id                          = "dao-aip" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "dao-aip" -> null
      - node_id                     = "R_kgDOMnbeDA" -> null
      - primary_language            = "Makefile" -> null
      - private                     = false -> null
      - repo_id                     = 846650892 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:Arrow-air/dao-aip.git" -> null
      - svn_url                     = "https://github.com/Arrow-air/dao-aip" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.repository["dao-aip"].github_repository_file.files[".commitlintrc.yml"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "c9d3fe7446941dbc393e0d0121853ee2f8e74587" -> null
      - content             = <<-EOT
            ---
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.commitlintrc.yml
            
            rules:
              body-leading-blank: [1, always]
              body-max-line-length: [2, always, 100]
              footer-leading-blank: [1, always]
              footer-max-line-length: [2, always, 100]
              header-max-length: [2, always, 100]
              subject-case:
                - 2
                - never
                - [sentence-case, start-case, pascal-case, upper-case]
              subject-empty: [2, never]
              subject-full-stop: [2, never, "."]
              type-case: [2, always, lower-case]
              type-empty: [2, never]
              type-enum:
                - 2
                - always
                - [build, chore, ci, docs, feat, fix, perf, refactor, revert, style, test]
        EOT -> null
      - file                = ".commitlintrc.yml" -> null
      - id                  = "dao-aip/.commitlintrc.yml" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "e08a687d6b75fe140e5028b1c7a764d32ad6aee3" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files[".cspell.config.yaml"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "fe1b6a4f9e5bba600aaef7276e29d3d43ce9b06b" -> null
      - content             = <<-EOT
            ---
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.cspell.config.yaml
            
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: "0.2"
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: "./.cspell.project-words.txt"
                addWords: true
            dictionaries: ["project-words"]
            ignoreRegExp:
              - '\..*'
            ignorePaths:
              - "node_modules"
              - "build"
              - "*.css"
              - "*.svg"
              - "*/**Makefile"
              - "target"
              - "logs"
              - "out"
              - "coverage"
              - "src/*.plan"
            noConfigSearch: true
        EOT -> null
      - file                = ".cspell.config.yaml" -> null
      - id                  = "dao-aip/.cspell.config.yaml" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "ccb7347989aa15a7ce848285dc2167b930465071" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files[".editorconfig"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "f8f97ad5ab88e111da80f183acb7adb05f500602" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.editorconfig
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [{*.md,*.mdx,LICENSE*}]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.rs]
            trim_trailing_whitespace = false
            indent_style = space
            indent_size = 4
            [{Makefile*,*.mk,*.sh}]
            indent_style = tab
            indent_size = 4
            [{*.ts,*.tsx,*.html,*.yml,*.yaml,*.toml,*.json,*.tf,*.hcl}]
            indent_size = 2
            # we might want to use https://www.npmjs.com/package/lintspaces instead, we can't lint the css and js comments atm
            [{*.js,*.css,Cargo.lock}]
            indent_size = unset
        EOT -> null
      - file                = ".editorconfig" -> null
      - id                  = "dao-aip/.editorconfig" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "7c5128f9196368215bc02b03ec8242ed2b1031e9" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files[".github/CODEOWNERS"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "872e2b8404decee8d5660fc5231221586ac14c06" -> null
      - content             = <<-EOT
            * @Arrow-air/governance
        EOT -> null
      - file                = ".github/CODEOWNERS" -> null
      - id                  = "dao-aip/.github/CODEOWNERS" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "be252169c2f8506f75c241fc51a2b1c3030201a1" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "e8d387afe268bc3a988b07b6eb63bf019e4c707a" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.github/workflows/sanity_checks.yml
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              push:
                branches:
                  - main
                  - develop
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              cspell:
                name: Spelling Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
            
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make md-test-links
        EOT -> null
      - file                = ".github/workflows/sanity_checks.yml" -> null
      - id                  = "dao-aip/.github/workflows/sanity_checks.yml" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "ec63a73045575514b60208b46bb35545af4ab5b9" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files[".make/base.mk"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "27058ebca0b35addb66bfa60f0a63331e3cac88d" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/base.mk
            
            SHELL := /bin/bash
            
            SANITYCHECKS_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-sanitychecks
            SANITYCHECKS_IMAGE_TAG  := 0.3
            
            SOURCE_PATH      ?= $(PWD)
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app \
            	-v "$(SOURCE_PATH)/:/usr/src/app" \
            	$(2) \
            	-t $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG) \
            	$(1)
            
            .SILENT: *docker-pull
            
            .help-base:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(SGR0)"
            
            docker-pull:
            	@echo docker pull -q $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG)
        EOT -> null
      - file                = ".make/base.mk" -> null
      - id                  = "dao-aip/.make/base.mk" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "e41edcf0b3d3b9eee8be4ac9f7e4d3f6294d781b" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files[".make/commitlint.mk"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "aadd269ce00f6923ad44c261d459bb4446dbf449" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/commitlint.mk
            
            COMMITLINT_CHECK :=
            
            .help-commitlint:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Commitlint$(SGR0)"
            	@echo "  $(BOLD)commitlint-test$(SGR0)  -- Run 'commitlint --edit $(COMMITLINT_CHECK)'"
            	@echo "                      to validate commit messages are following the conventional commit standards."
            
            commitlint-test: docker-pull
            	@echo "$(CYAN)Checking for commit message errors...$(SGR0)"
            	@$(call docker_run,commitlint --edit $(COMMITLINT_CHECK))
        EOT -> null
      - file                = ".make/commitlint.mk" -> null
      - id                  = "dao-aip/.make/commitlint.mk" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "3b14077fb45da6a020abdb8bc6ccf8c1653fad61" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files[".make/cspell.mk"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "86b4d0f697f2194f684ade8e8a963094c7b0bc3d" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/cspell.mk
            CSPELL_PROJECT_WORDS ?= .cspell.project-words.txt
            
            .help-cspell:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0)      -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                      to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            
            cspell-test: docker-pull
            ifeq ("$(wildcard $(CSPELL_PROJECT_WORDS))","")
            	@echo "$(YELLOW)No $(CSPELL_PROJECT_WORDS) found, creating...$(SGR0)"
            	touch $(CSPELL_PROJECT_WORDS)
            endif
            	@echo "$(CYAN)Checking for spelling errors...$(SGR0)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            cspell-add-words: docker-pull
            	@echo "$(CYAN)Adding words to the project's cspell word list...$(SGR0)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
        EOT -> null
      - file                = ".make/cspell.mk" -> null
      - id                  = "dao-aip/.make/cspell.mk" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "95fd2c4f42c7d4952ab13428939a5214ecdf6b0c" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files[".make/editorconfig.mk"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "978bb9f04dc453c1dcd7d9c94ccf5baedc8c7235" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/editorconfig.mk
            
            .help-editorconfig:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Editorconfig$(SGR0)"
            	@echo "  $(BOLD)editorconfig-test$(SGR0) -- Run editorconfig test to validate all file formats are valid"
            	@echo "  $(BOLD)editorconfig-tidy$(SGR0) -- Run editorconfig tidy to fix all file formats if needed"
            
            editorconfig-test:
            	@echo "$(CYAN)Checking if the codebase is compliant with the .editorconfig file...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            editorconfig-tidy: docker-pull
            	@echo "$(CYAN)Running editorconfig formatting fixes...$(SGR0)"
            	@$(call docker_run,sh -c 'eclint fix .')
        EOT -> null
      - file                = ".make/editorconfig.mk" -> null
      - id                  = "dao-aip/.make/editorconfig.mk" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "e76a6f45bf42e18c35b09dd3edb05eb8e5994343" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files[".make/markdown.mk"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "ad0667b9e82fdb65929e9da2c06c2c9a04f9eb9a" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/markdown.mk
            
            MARKDOWN_FILES ?= $(shell find . -type f -iname '*md' ! -iwholename "*./node_modules/*" ! -path "./build" ! -iwholename "*.terraform*" ! -iwholename "*.cargo/*" ! -iwholename "./target/*")
            LINK_CHECKER_JSON ?= .link-checker.config.json
            
            .help-markdown:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Markdown$(SGR0)"
            	@echo "  $(BOLD)md-test-links$(SGR0)   -- Run markdown-link-check on all markdown files to catch dead links."
            
            md-test-links:
            ifeq ("$(MARKDOWN_FILES)", "")
            	@echo "$(YELLOW)No markdown files found, skipping link validation...$(SGR0)"
            else
            ifeq ("$(wildcard $(LINK_CHECKER_JSON))","")
            	@echo "$(YELLOW)No $(LINK_CHECKER_JSON) found, creating...$(SGR0)"
            	echo -e "{\n}\n" > $(LINK_CHECKER_JSON)
            endif
            	@echo "$(CYAN)Checking if all document links are valid...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t ghcr.io/tcort/markdown-link-check:3.10 \
            		-c $(LINK_CHECKER_JSON) $(MARKDOWN_FILES)
            endif
        EOT -> null
      - file                = ".make/markdown.mk" -> null
      - id                  = "dao-aip/.make/markdown.mk" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "2f70574d160ab228796bc3575c2143553523a026" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files["CONTRIBUTING.md"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "494eaa273e8c387fe98a52098c47856ca8f59734" -> null
      - content             = <<-EOT
            See [Contributing Guide](https://www.arrowair.com/docs/contributing/intro)  on Arrow website.
        EOT -> null
      - file                = "CONTRIBUTING.md" -> null
      - id                  = "dao-aip/CONTRIBUTING.md" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "4d10683b5aa64bb3e762e23bca95ec378b663269" -> null
    }

  # module.repository["dao-aip"].github_repository_file.files["Makefile"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "files" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "6b3eb1d779c4587834de30cbe476eb89d5be844d" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
            DOCKER_NAME := arrow-dao-aip
            
            help: .help-base .help-cspell .help-markdown .help-editorconfig
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT -> null
      - file                = "Makefile" -> null
      - id                  = "dao-aip/Makefile" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "3e8b16682129248d6aba2235d560134ce26233c4" -> null
    }

  # module.repository["dao-aip"].github_repository_file.init will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_repository_file" "init" {
      - branch              = "main" -> null
      - commit_message      = <<-EOT
            ci: terraform provisioned file changes
            
            [skip ci]
        EOT -> null
      - commit_sha          = "d3ac15e7492a7ac9e4770f4232670541572411b6" -> null
      - content             = <<-EOT
            DO NOT REMOVE
            This repository is managed by Terraform and contains files that will be overwritten when changed
            This file is part of the management of repository dao-aip
        EOT -> null
      - file                = ".terraform_init" -> null
      - id                  = "dao-aip/.terraform_init" -> null
      - overwrite_on_create = true -> null
      - ref                 = "main" -> null
      - repository          = "dao-aip" -> null
      - sha                 = "bbcc4cfe2ee7b127b64d61f3c0ee20bf3f8a9dc2" -> null
    }

  # module.repository["dao-aip"].github_team_repository.maintainer["governance"] will be destroyed
  # (because module.repository["dao-aip"] is not in configuration)
  - resource "github_team_repository" "maintainer" {
      - etag       = "W/\"93d731d0f38baf854f22bd9e5a948152021f269e24513e3c3f258275e62c757f\"" -> null
      - id         = "10739150:dao-aip" -> null
      - permission = "maintain" -> null
      - repository = "dao-aip" -> null
      - team_id    = "governance" -> null
    }

  # module.repository["dao-aips"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + rename     = false
      + repository = "dao-aips"
    }

  # module.repository["dao-aips"].github_branch_protection.all["*"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "dao-aips"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository["dao-aips"].github_branch_protection.all["**/**"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "**/**"
      + repository_id                   = "dao-aips"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository["dao-aips"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "dao-aips"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository["dao-aips"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = false
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Arrowair DAO Arrow Improvement Proposals"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "dao-aips"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "disabled"
            }
        }
    }

  # module.repository["dao-aips"].github_repository_file.files[".commitlintrc.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.commitlintrc.yml
            
            rules:
              body-leading-blank: [1, always]
              body-max-line-length: [2, always, 100]
              footer-leading-blank: [1, always]
              footer-max-line-length: [2, always, 100]
              header-max-length: [2, always, 100]
              subject-case:
                - 2
                - never
                - [sentence-case, start-case, pascal-case, upper-case]
              subject-empty: [2, never]
              subject-full-stop: [2, never, "."]
              type-case: [2, always, lower-case]
              type-empty: [2, never]
              type-enum:
                - 2
                - always
                - [build, chore, ci, docs, feat, fix, perf, refactor, revert, style, test]
        EOT
      + file                = ".commitlintrc.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.cspell.config.yaml
            
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: "0.2"
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: "./.cspell.project-words.txt"
                addWords: true
            dictionaries: ["project-words"]
            ignoreRegExp:
              - '\..*'
            ignorePaths:
              - "node_modules"
              - "build"
              - "*.css"
              - "*.svg"
              - "*/**Makefile"
              - "target"
              - "logs"
              - "out"
              - "coverage"
              - "src/*.plan"
            noConfigSearch: true
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.editorconfig
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [{*.md,*.mdx,LICENSE*}]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.rs]
            trim_trailing_whitespace = false
            indent_style = space
            indent_size = 4
            [{Makefile*,*.mk,*.sh}]
            indent_style = tab
            indent_size = 4
            [{*.ts,*.tsx,*.html,*.yml,*.yaml,*.toml,*.json,*.tf,*.hcl}]
            indent_size = 2
            # we might want to use https://www.npmjs.com/package/lintspaces instead, we can't lint the css and js comments atm
            [{*.js,*.css,Cargo.lock}]
            indent_size = unset
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/governance
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.github/workflows/sanity_checks.yml
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              push:
                branches:
                  - main
                  - develop
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              cspell:
                name: Spelling Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
            
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make md-test-links
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files[".make/base.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/base.mk
            
            SHELL := /bin/bash
            
            SANITYCHECKS_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-sanitychecks
            SANITYCHECKS_IMAGE_TAG  := 0.3
            
            SOURCE_PATH      ?= $(PWD)
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app \
            	-v "$(SOURCE_PATH)/:/usr/src/app" \
            	$(2) \
            	-t $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG) \
            	$(1)
            
            .SILENT: *docker-pull
            
            .help-base:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(SGR0)"
            
            docker-pull:
            	@echo docker pull -q $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG)
        EOT
      + file                = ".make/base.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files[".make/commitlint.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/commitlint.mk
            
            COMMITLINT_CHECK :=
            
            .help-commitlint:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Commitlint$(SGR0)"
            	@echo "  $(BOLD)commitlint-test$(SGR0)  -- Run 'commitlint --edit $(COMMITLINT_CHECK)'"
            	@echo "                      to validate commit messages are following the conventional commit standards."
            
            commitlint-test: docker-pull
            	@echo "$(CYAN)Checking for commit message errors...$(SGR0)"
            	@$(call docker_run,commitlint --edit $(COMMITLINT_CHECK))
        EOT
      + file                = ".make/commitlint.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files[".make/cspell.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/cspell.mk
            CSPELL_PROJECT_WORDS ?= .cspell.project-words.txt
            
            .help-cspell:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0)      -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                      to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            
            cspell-test: docker-pull
            ifeq ("$(wildcard $(CSPELL_PROJECT_WORDS))","")
            	@echo "$(YELLOW)No $(CSPELL_PROJECT_WORDS) found, creating...$(SGR0)"
            	touch $(CSPELL_PROJECT_WORDS)
            endif
            	@echo "$(CYAN)Checking for spelling errors...$(SGR0)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            cspell-add-words: docker-pull
            	@echo "$(CYAN)Adding words to the project's cspell word list...$(SGR0)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
        EOT
      + file                = ".make/cspell.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files[".make/editorconfig.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/editorconfig.mk
            
            .help-editorconfig:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Editorconfig$(SGR0)"
            	@echo "  $(BOLD)editorconfig-test$(SGR0) -- Run editorconfig test to validate all file formats are valid"
            	@echo "  $(BOLD)editorconfig-tidy$(SGR0) -- Run editorconfig tidy to fix all file formats if needed"
            
            editorconfig-test:
            	@echo "$(CYAN)Checking if the codebase is compliant with the .editorconfig file...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            editorconfig-tidy: docker-pull
            	@echo "$(CYAN)Running editorconfig formatting fixes...$(SGR0)"
            	@$(call docker_run,sh -c 'eclint fix .')
        EOT
      + file                = ".make/editorconfig.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files[".make/markdown.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/markdown.mk
            
            MARKDOWN_FILES ?= $(shell find . -type f -iname '*md' ! -iwholename "*./node_modules/*" ! -path "./build" ! -iwholename "*.terraform*" ! -iwholename "*.cargo/*" ! -iwholename "./target/*")
            LINK_CHECKER_JSON ?= .link-checker.config.json
            
            .help-markdown:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Markdown$(SGR0)"
            	@echo "  $(BOLD)md-test-links$(SGR0)   -- Run markdown-link-check on all markdown files to catch dead links."
            
            md-test-links:
            ifeq ("$(MARKDOWN_FILES)", "")
            	@echo "$(YELLOW)No markdown files found, skipping link validation...$(SGR0)"
            else
            ifeq ("$(wildcard $(LINK_CHECKER_JSON))","")
            	@echo "$(YELLOW)No $(LINK_CHECKER_JSON) found, creating...$(SGR0)"
            	echo -e "{\n}\n" > $(LINK_CHECKER_JSON)
            endif
            	@echo "$(CYAN)Checking if all document links are valid...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t ghcr.io/tcort/markdown-link-check:3.10 \
            		-c $(LINK_CHECKER_JSON) $(MARKDOWN_FILES)
            endif
        EOT
      + file                = ".make/markdown.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files["CONTRIBUTING.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            See [Contributing Guide](https://www.arrowair.com/docs/contributing/intro)  on Arrow website.
        EOT
      + file                = "CONTRIBUTING.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "main"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/Makefile
            
            DOCKER_NAME := arrow-dao-aips
            
            help: .help-base .help-cspell .help-markdown .help-editorconfig
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_repository_file.init will be created
  + resource "github_repository_file" "init" {
      + branch              = "main"
      + commit_message      = <<-EOT
            ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT REMOVE
            This repository is managed by Terraform and contains files that will be overwritten when changed
            This file is part of the management of repository dao-aips
        EOT
      + file                = ".terraform_init"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "dao-aips"
      + sha                 = (known after apply)
    }

  # module.repository["dao-aips"].github_team_repository.maintainer["governance"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "dao-aips"
      + team_id    = "governance"
    }

Plan: 19 to add, 0 to change, 19 to destroy.

```

</details>

*Pusher: @KCerveny, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*